front-end-resume.tex
% Created 2015-10-10 Sat 11:16
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage[hidelinks]{hyperref}
\tolerance=1000
\usepackage[utf8]{inputenc}
\usepackage[scaled]{helvet}
\renewcommand*\familydefault{\sfdefault}
\author{Oleg Sivokon}
\date{\textit{<2015-10-10 Sat>}}
\title{Resume}
\hypersetup{
 pdfauthor={Oleg Sivokon},
 pdftitle={Resume},
 pdfkeywords={Resume, job, employment, cv},
 pdfsubject={My resume},
 pdfcreator={Emacs 25.0.50.1 (Org mode 8.3beta)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Contact Information}
\label{sec:orgheadline1}
\begin{center}
\begin{tabular}{ll}
Name: & Oleg Sivokon\\
Birth date: & 23, 06, 1978\\
Cell phone: & +972 (0) 544-563314\\
Email: & \href{mailto:olegsivokon@gmail.com}{olegsivokon@gmail.com}\\
Address: & Florentin 50, Tel Aviv, Israel\\
\end{tabular}
\end{center}

\emph{You can find an up-to-date electronic copy of this document at}

\url{https://github.com/wvxvw/resume}

\clearpage

\section{Technology Summary}
\label{sec:orgheadline8}
\subsection{Languages}
\label{sec:orgheadline2}
ActionScript, C, Clojure, Common Lisp, Emacs Lisp, Erlang, Forth, Haskell,
Haxe, Java, JavaScript, Mercury, OCaml, PHP, Prolog, Python, Ruby, Scala,
Scheme, Shell.

\subsection{Mathematics And Statistics}
\label{sec:orgheadline3}
J, Julia, Maxima, Octave (Matlab), R (S).

\subsection{Related Technologies}
\label{sec:orgheadline4}
Data representation formats (XML, YAML, JSON, RDF, AMF), Graph databases,
Network protocols (TCP, UDP, HTTP, FTP), Relational databases (SQL), Web
stack (HTML, CSS).

\subsection{Programming Environments}
\label{sec:orgheadline5}
Eclipse, Emacs, Intellij IDEA, Vim, Visual Studio.

\subsection{Operating Systems}
\label{sec:orgheadline6}
Android, GNU/Linux, Mac OS, Microsoft Windows.

\subsection{Infrastructure}
\label{sec:orgheadline7}
Ant, Maven, Gradle, Make, Grunt, Jenkins, JIRA, Redmine, Track, Mediawiki,
Bugzilla, Selenium, Flex Unit, JUnit, unittest (Python), 5am, Cucumber, Git,
Subversion, Mercurial, Perforce, Bazaar.

\clearpage

\section{Work History}
\label{sec:orgheadline12}

\subsection{PowToon Ltd.}
\label{sec:orgheadline9}
\begin{description}
\item[{Position}] \emph{Programmer}
\item[{Term}] \emph{January 2014--May 2015}
\item[{Accomplishments}] \(\;\)

\begin{itemize}
\item I rewrote a major application component (the player) in Haxe (compiled to
Flash and C++).
\item I wrote most of the infrastructure code s.a. build scripts, automated
test generation and continuous integration server setup using Ant, Grdle
and various utilities written in Python, s.a. Fabric.
\item I wrote several designs for the product.
\end{itemize}
\end{description}

\subsection{TransGaming Inc.}
\label{sec:orgheadline10}
\begin{description}
\item[{Position}] \emph{Programmer}
\item[{Term}] \emph{April 2013--2013 (less than a year)}
\item[{Accomplishments}] \(\;\)

\begin{itemize}
\item I wrote a game portal for ``Smart TV'' deployment using TypeScript.
\item I wrote a tester program, which stress-tested the program performance
on ``Smart TV'' in Python.
\item I wrote automated build for my project using Ant.
\item I wrote a sizable chunk of code dealing with usage statistic aggregation
based on Google Analytics in JavaScript.
\end{itemize}
\end{description}

\subsection{Rounds}
\label{sec:orgheadline11}
\begin{description}
\item[{Position}] \emph{Programmer}
\item[{Term}] \emph{December 2010 – August 2011 (9 months)}
\item[{Accomplishments}] \(\;\)

\begin{itemize}
\item I rewrote the communication part of the video chat application in
ActionScript.
\item I wrote a testing server and utility programs for automated testing in
Erlang.
\item I also wrote a small natural language processing program which was used
to advertise the company's product.
\end{itemize}
\end{description}

\section{Courses}
\label{sec:orgheadline13}
I am a second year student at Open University of Israel.

I took online courses at edX and Coursera.  The list is not exhaustive: 
Data Scientists Toolbox, Statistics, Data Analysis, Machine Learning.

\section{Volunteering And Community Work}
\label{sec:orgheadline14}
SCons project, ActionScript plugin.  (SCons is an extensible build system
written in Python).

For several years I was a member of Adobe Community Board.  I moderated a
forum dedicated to Flash and ActionScript.

I'm an active member of Emacs Q/A site from the StackExchange family.

\section{Examples Of My Work}
\label{sec:orgheadline15}
My Github profile:
\url{https://github.com/wvxvw/}.

\section{Hobbies}
\label{sec:orgheadline16}
\begin{itemize}
\item NLP
\item Computational linguistics
\item Moral philosophy
\item General AI
\item Graphs
\end{itemize}
\end{document}